02_monod_FieldOperations/testCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.05;

writeControl    timeStep;

writeInterval   1000; 

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//functions
//{
//    forces
//    {
//        type                 forces;
//        libs                 ("libforces.so");
//        writeControl         timeStep;
//        writeInterval        100;
//        patches              (stirrer);
//        rho                  rhoInf;
//        log                  true;
//        rhoInf               933.33;
//        CofR                 (0 0 0.02);
//    }
//}

//********************************************************* //
